// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "プロキシ サーバ設定";
HSDTaskDescription = "プリンタは、インターネットへの接続をサポートしています。プロキシ サーバを使用してインターネットに接続している場合、下にその設定を入力してください。";
TaskDescriptionInAssistantMode = "HP Web サービスに接続するには、プリンタがインターネットに接続されている必要があります。プロキシ サーバーを使用してインターネットに接続している場合、下にその設定を入力してください。\n\nプロキシ設定がわからない場合は、ネットワークの基本設定ウィンドウの設定を参照するか、 システム管理者に問い合わせてください。";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "インターネットへの接続にプロキシ サーバは不要です";
HSDAutomaticProxySettingsTitle = "自動 (デバイスは設定を自動的に検出します)";
HSDCustomProxySettingsTitle = "カスタム プロキシ サーバ構成:";
HSDSystemProxySettingsTitle = "システム設定のコピー";

// Proxy server settings
HSDProxyServerTitle = "プロキシ サーバ:";
ProxyPortTitle = "プロキシポート:";

// Authentication
HSDRequiresAuthenticationButton = "プロキシ サーバには認証が必要です";
HSDUserNameTitle = "ユーザ名:";
HSDPasswordTitle = "パスワード:";

HSDApplyNowButtonTitle = "今すぐ適用";

// progress titles
UpdateInformationProcessTitle = "情報を更新しています...";

// alerts
EmptyProxyServerOrPortErrorText = "プロキシ サーバとプロキシ ポートの両方を指定する必要があります。";

EmptyUserNameOrPasswordErrorText = "プロキシ サーバ認証では、ユーザ名とパスワードの両方を指定する必要があります。";

IncorrectProxyServerNameFormatErrorText = "プロキシ サーバ名を設定できませんでした。形式が有効かどうか確認してください。";

HSDUserNameTooLargeErrorText = "ユーザー名が長すぎます。お使いのデバイスでは最大 %d 文字のユーザー名が使用できます。";
